nusschAngE/stm32h7xx/Hardware/lcd/lcd.c
	nt35510_set_register(0xD50C,0x00);
	nt35510_set_register(0xD50D,0xA6);
	nt35510_set_register(0xD50E,0x00);
	nt35510_set_register(0xD50F,0xE5);
	nt35510_set_register(0xD510,0x01);
	nt35510_set_register(0xD511,0x13);
	nt35510_set_register(0xD512,0x01);
	nt35510_set_register(0xD513,0x54);
	nt35510_set_register(0xD514,0x01);
	nt35510_set_register(0xD515,0x82);
	nt35510_set_register(0xD516,0x01);
	nt35510_set_register(0xD517,0xCA);
	nt35510_set_register(0xD518,0x02);
	nt35510_set_register(0xD519,0x00);
	nt35510_set_register(0xD51A,0x02);
	nt35510_set_register(0xD51B,0x01);
	nt35510_set_register(0xD51C,0x02);
	nt35510_set_register(0xD51D,0x34);
	nt35510_set_register(0xD51E,0x02);
	nt35510_set_register(0xD51F,0x67);
	nt35510_set_register(0xD520,0x02);
	nt35510_set_register(0xD521,0x84);
	nt35510_set_register(0xD522,0x02);
	nt35510_set_register(0xD523,0xA4);
	nt35510_set_register(0xD524,0x02);
	nt35510_set_register(0xD525,0xB7);
	nt35510_set_register(0xD526,0x02);
	nt35510_set_register(0xD527,0xCF);
	nt35510_set_register(0xD528,0x02);
	nt35510_set_register(0xD529,0xDE);
	nt35510_set_register(0xD52A,0x02);
	nt35510_set_register(0xD52B,0xF2);
	nt35510_set_register(0xD52C,0x02);
	nt35510_set_register(0xD52D,0xFE);
	nt35510_set_register(0xD52E,0x03);
	nt35510_set_register(0xD52F,0x10);
	nt35510_set_register(0xD530,0x03);
	nt35510_set_register(0xD531,0x33);
	nt35510_set_register(0xD532,0x03);
	nt35510_set_register(0xD533,0x6D);
	nt35510_set_register(0xD600,0x00);
	nt35510_set_register(0xD601,0x33);
	nt35510_set_register(0xD602,0x00);
	nt35510_set_register(0xD603,0x34);
	nt35510_set_register(0xD604,0x00);
	nt35510_set_register(0xD605,0x3A);
	nt35510_set_register(0xD606,0x00);
	nt35510_set_register(0xD607,0x4A);
	nt35510_set_register(0xD608,0x00);
	nt35510_set_register(0xD609,0x5C);
	nt35510_set_register(0xD60A,0x00);
	nt35510_set_register(0xD60B,0x81);

	nt35510_set_register(0xD60C,0x00);
	nt35510_set_register(0xD60D,0xA6);
	nt35510_set_register(0xD60E,0x00);
	nt35510_set_register(0xD60F,0xE5);
	nt35510_set_register(0xD610,0x01);
	nt35510_set_register(0xD611,0x13);
	nt35510_set_register(0xD612,0x01);
	nt35510_set_register(0xD613,0x54);
	nt35510_set_register(0xD614,0x01);
	nt35510_set_register(0xD615,0x82);
	nt35510_set_register(0xD616,0x01);
	nt35510_set_register(0xD617,0xCA);
	nt35510_set_register(0xD618,0x02);
	nt35510_set_register(0xD619,0x00);
	nt35510_set_register(0xD61A,0x02);
	nt35510_set_register(0xD61B,0x01);
	nt35510_set_register(0xD61C,0x02);
	nt35510_set_register(0xD61D,0x34);
	nt35510_set_register(0xD61E,0x02);
	nt35510_set_register(0xD61F,0x67);
	nt35510_set_register(0xD620,0x02);
	nt35510_set_register(0xD621,0x84);
	nt35510_set_register(0xD622,0x02);
	nt35510_set_register(0xD623,0xA4);
	nt35510_set_register(0xD624,0x02);
	nt35510_set_register(0xD625,0xB7);
	nt35510_set_register(0xD626,0x02);
	nt35510_set_register(0xD627,0xCF);
	nt35510_set_register(0xD628,0x02);
	nt35510_set_register(0xD629,0xDE);
	nt35510_set_register(0xD62A,0x02);
	nt35510_set_register(0xD62B,0xF2);
	nt35510_set_register(0xD62C,0x02);
	nt35510_set_register(0xD62D,0xFE);
	nt35510_set_register(0xD62E,0x03);
	nt35510_set_register(0xD62F,0x10);
	nt35510_set_register(0xD630,0x03);
	nt35510_set_register(0xD631,0x33);
	nt35510_set_register(0xD632,0x03);
	nt35510_set_register(0xD633,0x6D);
	//LV2 Page 0 enable
	nt35510_set_register(0xF000,0x55);
	nt35510_set_register(0xF001,0xAA);
	nt35510_set_register(0xF002,0x52);
	nt35510_set_register(0xF003,0x08);
	nt35510_set_register(0xF004,0x00);
	//Display control
	nt35510_set_register(0xB100, 0xCC);
	nt35510_set_register(0xB101, 0x00);
	//Source hold time
	nt35510_set_register(0xB600,0x05);
	//Gate EQ control
	nt35510_set_register(0xB700,0x70);
	nt35510_set_register(0xB701,0x70);
	//Source EQ control (Mode 2)
	nt35510_set_register(0xB800,0x01);
	nt35510_set_register(0xB801,0x03);
	nt35510_set_register(0xB802,0x03);
	nt35510_set_register(0xB803,0x03);
	//Inversion mode (2-dot)
	nt35510_set_register(0xBC00,0x02);
	nt35510_set_register(0xBC01,0x00);
	nt35510_set_register(0xBC02,0x00);
	//Timing control 4H w/ 4-delay
	nt35510_set_register(0xC900,0xD0);
	nt35510_set_register(0xC901,0x02);
	nt35510_set_register(0xC902,0x50);
	nt35510_set_register(0xC903,0x50);
	nt35510_set_register(0xC904,0x50);
	nt35510_set_register(0x3500,0x00);
	//nt35510_set_register(0x3600,0x00);
	nt35510_set_register(0x3A00,0x55);  //16-bit/pixel
	nt35510_write_reg(0x1100); //sleep out
    uSleep(5000);
	nt35510_write_reg(0x2800); //display off

	lcdDev.id = 35510;
	lcdDev.dir = 0;
	lcdDev.width = DEFAULT_LCD_WIDTH;
	lcdDev.height = DEFAULT_LCD_HEIGHT;

    /* lcd device set on */
    lcd_SetScanDirection(DEFAULT_SCANDIR);
    lcd_SetBacklightOnOff(TRUE);
    lcd_SetOnOff(TRUE);
    //lcd_Clear(0x0000);//black
    lcd_FieldBlock(0, 0 , 480 , 800, 0x0000);
}

void lcd_SetOnOff(uint8_t on)
{
    nt35510_write_reg(on ? NT35510_DISP_ON : NT35510_DISP_OFF);
}

void lcd_SetBacklightOnOff(uint8_t on)
{
    HAL_GPIO_WritePin(LCD_BK_GPIO, LCD_BK_PIN, (on ? GPIO_PIN_SET : GPIO_PIN_RESET));
}

void lcd_SetScanDirection(uint8_t dir)
{
	uint16_t regval = 0;

	switch(dir)
	{
		case L2R_U2D:
			lcdDev.dir = L2R_U2D;
	        lcdDev.width = DEFAULT_LCD_WIDTH;
	        lcdDev.height = DEFAULT_LCD_HEIGHT;
	        regval |= (0<<7)|(0<<6)|(0<<5);
			break;
		case L2R_D2U:
		    lcdDev.dir = L2R_D2U;
	        lcdDev.width = DEFAULT_LCD_WIDTH;
	        lcdDev.height = DEFAULT_LCD_HEIGHT;
			regval |= (1<<7)|(0<<6)|(0<<5); 
			break;
		case R2L_U2D:
		    lcdDev.dir = R2L_U2D;
	        lcdDev.width = DEFAULT_LCD_WIDTH;
	        lcdDev.height = DEFAULT_LCD_HEIGHT;
			regval |= (0<<7)|(1<<6)|(0<<5); 
			break;
		case R2L_D2U:
		    lcdDev.dir = R2L_D2U;
	        lcdDev.width = DEFAULT_LCD_WIDTH;
	        lcdDev.height = DEFAULT_LCD_HEIGHT;
			regval |= (1<<7)|(1<<6)|(0<<5); 
			break;	 
		case U2D_L2R:
		    lcdDev.dir = U2D_L2R;
	        lcdDev.width = DEFAULT_LCD_HEIGHT;
	        lcdDev.height = DEFAULT_LCD_WIDTH;
			regval |= (0<<7)|(0<<6)|(1<<5); 
			break;
		case U2D_R2L:
		    lcdDev.dir = U2D_R2L;
	        lcdDev.width = DEFAULT_LCD_HEIGHT;
	        lcdDev.height = DEFAULT_LCD_WIDTH;
			regval |= (0<<7)|(1<<6)|(1<<5); 
			break;
		case D2U_L2R:
		    lcdDev.dir = D2U_L2R;
	        lcdDev.width = DEFAULT_LCD_HEIGHT;
	        lcdDev.height = DEFAULT_LCD_WIDTH;
			regval |= (1<<7)|(0<<6)|(1<<5); 
			break;
		case D2U_R2L:
		    lcdDev.dir = D2U_R2L;
	        lcdDev.width = DEFAULT_LCD_HEIGHT;
	        lcdDev.height = DEFAULT_LCD_WIDTH;
			regval |= (1<<7)|(1<<6)|(1<<5); 
            break;
        default:
	        lcdDev.dir = L2R_U2D;
	        lcdDev.width = DEFAULT_LCD_WIDTH;
	        lcdDev.height = DEFAULT_LCD_HEIGHT;
	        regval |= (0<<7)|(0<<6)|(0<<5);    
			break;	 
	}

	nt35510_set_register(NT35510_MADCTL, regval);
}

uint8_t lcd_SetWorkRegion(uint16_t x, uint16_t y, uint16_t w, uint16_t h)
{
    uint16_t tmp = 0;

    if((x >= lcdDev.width) || (y >= lcdDev.height))
        return (LCD_BC);

    /* start column */
    nt35510_set_register(NT35510_SET_COLUMN,     x >> 8);
    nt35510_set_register(NT35510_SET_COLUMN + 1, x & 0xff);
    /* end column */
    tmp = x + w - 1;
    nt35510_set_register(NT35510_SET_COLUMN + 2, tmp >> 8);
    nt35510_set_register(NT35510_SET_COLUMN + 3, tmp & 0xff);

    /* start row */
    nt35510_set_register(NT35510_SET_ROW,     y >> 8);
    nt35510_set_register(NT35510_SET_ROW + 1, y & 0xff);   
    /* end row */
    tmp = y + h - 1;
    nt35510_set_register(NT35510_SET_ROW + 2, tmp >> 8);
    nt35510_set_register(NT35510_SET_ROW + 3, tmp & 0xff);

    return (LCD_OK);
}

uint8_t lcd_FlushData(LCD_COLOR *pData, uint32_t size, uint8_t type)
{
    nt35510_write_reg(NT35510_FLUSH_RAM);

